lecture-demo/TeaTime/app/controllers/api/teas_controller.rb

SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @tea = Tea.find(params[:id])

SELECT "teas".* FROM "teas"
---
    def index
        @teas = Tea.all

INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "ginger"], ["price", 4000.99], ["description", nil], ["created_at", "2023-11-03 15:01:31.500705"], ["updated_at", "2023-11-03 15:01:31.500705"]]
---
    def create
        tea = Tea.new(tea_params)
        if tea.save