lecture-demo/TeaTime/app/views/api/teas/show.json.jbuilder

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 1], ["id", 5], ["id", 6]]
SELECT "transactions"."id" FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 2]]
---
transactions = @tea.transactions.includes(:user)